Repository: AZZAM-ALNAMER/virtual-dressing
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Virtual Fitting System
ar: نظام القياس الافتراضي

source: Home
ar: الرئيسية

source: Store
ar: المتجر

source: Try Virtual Fitting
ar: جرب القياس الافتراضي

source: Inventory
ar: المخزون

source: AI-powered virtual fitting for the perfect size and style.
ar: قياس افتراضي مدعوم بالذكاء الاصطناعي للحجم والستايل المثالي.

source: Quick Links
ar: روابط سريعة

source: Virtual Fitting
ar: القياس الافتراضي

source: Contact
ar: اتصل بنا

source: In-store system prototype
ar: نموذج نظام داخل المتجر

source: 1. Body Scan
ar: ١. مسح الجسم

source: 2. Skin Tone Analysis
ar: ٢. تحليل لون البشرة

source: 3. Get Recommendations
ar: ٣. احصل على التوصيات

source: 30-day guarantee
ar: ضمان ٣٠ يوماً

source: Accurate Measurements
ar: قياسات دقيقة

source: AI Recommended Size
ar: المقاس الموصى به بالذكاء الاصطناعي

source: AI-powered body scanning provides precise measurements
ar: مسح الجسم بالذكاء الاصطناعي يعطي قياسات دقيقة

source: Align your body with the guide
ar: اصطف جسدك مع الدليل

source: Align your full body with the guide outline
ar: اصطف جسدك بالكامل مع حدود الدليل

source: All
ar: الكل

source: All Categories
ar: جميع الفئات

source: All Inventory
ar: كل المخزون

source: All items below are available in your size
ar: جميع القطع أدناه متوفرة بمقاسك

source: Analysing with YOLO + AI...
ar: جاري التحليل بـ YOLO والذكاء الاصطناعي...

source: Apply
ar: تطبيق

source: Auto-capturing when position is correct...
ar: التقاط تلقائي عندما يكون الوضع صحيحاً...

source: Available Color
ar: اللون المتوفر

source: Available Colors
ar: الألوان المتوفرة

source: Available Sizes
ar: المقاسات المتوفرة

source: Back to Store
ar: العودة للمتجر

source: Based on your body measurements analysed by YOLO + LLM
ar: بناءً على قياسات جسمك المحللة بـ YOLO و LLM

source: Body Pose
ar: وضعية الجسم

source: Body image ready
ar: صورة الجسم جاهزة

source: Body photo: full body visible from head to toe, good lighting
ar: صورة الجسم: الجسم كامل من الرأس للقدمين، إضاءة جيدة

source: Body photo: stand straight with arms slightly away from body
ar: صورة الجسم: قف مستقيماً وذراعاك بعيدتان قليلاً عن الجسد

source: Body pose
ar: وضعية الجسم

source: Browse All Products
ar: تصفح كل المنتجات

source: Browse Store
ar: تصفح المتجر

source: Camera Scan
ar: مسح بالكاميرا

source: Camera access denied
ar: تم رفض الوصول للكاميرا

source: Camera access denied. Please allow camera access.
ar: تم رفض الوصول للكاميرا. يرجى السماح بالوصول للكاميرا.

source: Captured Images:
ar: الصور الملتقطة:

source: Category
ar: الفئة

source: Check back later or browse our full catalogue
ar: راجع لاحقاً أو تصفح كامل الكتالوج

source: Clear Filters
ar: مسح الفلاتر

source: Close-up of your face, good lighting
ar: صورة قريبة لوجهك، إضاءة جيدة

source: Come close! Fill the circle with your face
ar: اقترب! املأ الدائرة بوجهك

source: Come close to the camera like a selfie!
ar: اقترب من الكاميرا مثل السيلفي!

source: Detected from your face selfie using colour analysis
ar: تم اكتشافه من صورة وجهك باستخدام تحليل اللون

source: Detected Skin Tone
ar: لون البشرة المكتشف

source: Detecting pose, measuring body, detecting skin tone...
ar: جاري اكتشاف الوضعية وقياس الجسم ولون البشرة...

source: Discover Your Style
ar: اكتشف أسلوبك

source: Drop body photo here
ar: أفلت صورة الجسم هنا

source: Drop face selfie here
ar: أفلت صورة الوجه هنا

source: Easy Returns
ar: إرجاع سهل

source: Ensure good, natural lighting on your face
ar: تأكد من إضاءة طبيعية جيدة على وجهك

source: Explore our curated collection of premium clothing
ar: استكشف مجموعتنا المختارة من الملابس المميزة

source: Face Selfie
ar: صورة الوجه

source: Face image ready
ar: صورة الوجه جاهزة

source: Face selfie
ar: صورة الوجه

source: Face selfie: close-up, face fills most of the frame
ar: صورة الوجه: قريبة، الوجه يملأ معظم الإطار

source: Face selfie: natural lighting, no heavy filters
ar: صورة الوجه: إضاءة طبيعية، بدون فلاتر قوية

source: Find Your Perfect Fit
ar: اعثر على مقاسك المثالي

source: Fit
ar: مقاس

source: Free Shipping
ar: شحن مجاني

source: Gender
ar: الجنس

source: Get color and style recommendations tailored to you
ar: احصل على توصيات لون وستايل مخصصة لك

source: Get personalized clothing recommendations based on your body measurements and skin tone. No more guessing sizes!
ar: احصل على توصيات ملابس مخصصة حسب قياسات جسمك ولون بشرتك. لا مزيد من تخمين المقاسات!

source: Hold still!
ar: ابق ثابتاً!

source: How It Works
ar: كيف يعمل

source: Image captures automatically when you're close enough!
ar: يتم التقاط الصورة تلقائياً عندما تكون قريباً بما يكفي!

source: Image captures automatically when you're positioned correctly!
ar: يتم التقاط الصورة تلقائياً عندما تكون في الوضع الصحيح!

source: In Stock
ar: متوفر

source: Initializing camera...
ar: جاري تهيئة الكاميرا...

source: Inventory Dashboard
ar: لوحة المخزون

source: Inventory Dashboard - Virtual Fitting System
ar: لوحة المخزون - نظام القياس الافتراضي

source: Low Stock
ar: مخزون منخفض

source: Low Stock Alerts
ar: تنبيهات المخزون المنخفض

source: Manage your product inventory
ar: إدارة مخزون المنتجات

source: Manage Inventory in Admin Panel
ar: إدارة المخزون من لوحة الإدارة

source: Men
ar: رجال

source: No colors currently available
ar: لا ألوان متوفرة حالياً

source: No person detected – step into frame
ar: لم يُكتشف شخص – ادخل في الإطار

source: No products in size
ar: لا توجد منتجات بالمقاس

source: No Products Found
ar: لم يتم العثور على منتجات

source: No sizes currently available
ar: لا مقاسات متوفرة حالياً

source: Not Sure About Your Size?
ar: لست متأكداً من مقاسك؟

source: No more trying on multiple sizes in the fitting room
ar: لا مزيد من تجربة مقاسات متعددة في غرفة القياس

source: On orders over $50
ar: للطلبات فوق ٥٠ دولاراً

source: Out of Stock
ar: نفد من المخزون

source: Personalized Style
ar: ستايل مخصص

source: Please capture a body pose image.
ar: يرجى التقاط صورة لوضعية الجسم.

source: Please capture a face selfie.
ar: يرجى التقاط صورة للوجه.

source: Please enter a valid height (100–250 cm) before processing.
ar: يرجى إدخال طول صحيح (١٠٠–٢٥٠ سم) قبل المعالجة.

source: Please enter a valid height between 100 and 250 cm.
ar: يرجى إدخال طول صحيح بين ١٠٠ و ٢٥٠ سم.

source: Please upload a body pose image.
ar: يرجى رفع صورة لوضعية الجسم.

source: Please upload a face selfie image.
ar: يرجى رفع صورة للوجه.

source: Position your face in the centre of the guide
ar: ضع وجهك في مركز الدليل

source: Premium Quality
ar: جودة مميزة

source: Privacy First
ar: الخصوصية أولاً

source: Process Scan
ar: معالجة المسح

source: Processing
ar: جاري المعالجة

source: Processing failed. Please try again.
ar: فشلت المعالجة. يرجى المحاولة مرة أخرى.

source: Product
ar: المنتج

source: Products That Fit You
ar: منتجات تناسبك

source: Quantity
ar: الكمية

source: Ready to Find Your Perfect Fit?
ar: مستعد لمعرفة مقاسك المثالي؟

source: Ready to process your scan!
ar: جاهز لمعالجة مسحك!

source: Receive personalized size, fit, and style recommendations from our available inventory, all tailored to you.
ar: احصل على توصيات مقاس وستايل مخصصة من مخزوننا المتاح، كلها مصممة لك.

source: Remove
ar: إزالة

source: required for accurate measurements
ar: مطلوب للقياسات الدقيقة

source: required – close-up face for skin tone
ar: مطلوب – صورة قريبة للوجه لتحليل لون البشرة

source: required – full body, front view
ar: مطلوب – الجسم كامل، من الأمام

source: Save Time
ar: وفر الوقت

source: Save $20
ar: وفر ٢٠ دولاراً

source: Scan Another Customer
ar: مسح عميل آخر

source: Scan Complete!
ar: اكتمل المسح!

source: Search
ar: بحث

source: Search for products...
ar: ابحث عن منتجات...

source: Size
ar: المقاس

source: Stand 2–3 metres away from the camera
ar: قف على بعد ٢–٣ أمتار من الكاميرا

source: Stand straight with arms slightly away from your body
ar: قف مستقيماً وذراعاك بعيدتان قليلاً عن جسدك

source: Stand facing the camera, full body visible
ar: قف مواجهاً الكاميرا، الجسم كامل ظاهر

source: Start Now
ar: ابدأ الآن

source: Start Over
ar: ابدأ من جديد

source: Start Virtual Fitting
ar: ابدأ القياس الافتراضي

source: Status
ar: الحالة

source: Step 1: Body Pose (Auto-Capture)
ar: الخطوة ١: وضعية الجسم (التقاط تلقائي)

source: Step 2: Face Selfie (Auto-Capture)
ar: الخطوة ٢: صورة الوجه (التقاط تلقائي)

source: Step 3: Ready to Process
ar: الخطوة ٣: جاهز للمعالجة

source: Store - Virtual Fitting System
ar: المتجر - نظام القياس الافتراضي

source: Try Virtual Fitting Now
ar: جرب القياس الافتراضي الآن

source: Try adjusting your filters or search query.
ar: حاول تعديل الفلاتر أو عبارة البحث.

source: Try our AI-powered virtual fitting system for personalized size recommendations and perfect fit!
ar: جرب نظام القياس الافتراضي بالذكاء الاصطناعي لتوصيات مقاس مخصصة وملاءمة مثالية!

source: Total Variants
ar: إجمالي المتغيرات

source: Two images needed: full-body pose + face selfie
ar: صورتان مطلوبتان: وضعية الجسم كامل + صورة الوجه

source: Upload Body Images
ar: رفع صور الجسم

source: Upload Images
ar: رفع صور

source: Upload a full-body photo AND a face selfie for AI analysis
ar: ارفع صورة الجسم كامل وصورة الوجه لتحليل الذكاء الاصطناعي

source: View Details
ar: عرض التفاصيل

source: View Product Details
ar: عرض تفاصيل المنتج

source: Virtual Body Scan
ar: مسح الجسم الافتراضي

source: Virtual Body Scan - Virtual Fitting System
ar: مسح الجسم الافتراضي - نظام القياس الافتراضي

source: Virtual Fitting System - Find Your Perfect Fit
ar: نظام القياس الافتراضي - اعثر على مقاسك المثالي

source: With AI Technology
ar: بتقنية الذكاء الاصطناعي

source: Women
ar: نساء

source: Why Virtual Fitting?
ar: لماذا القياس الافتراضي؟

source: You May Also Like
ar: قد يعجبك أيضاً

source: Your Height
ar: طولك

source: Your Size
ar: مقاسك

source: Your face should fill most of the circle
ar: يجب أن يملأ وجهك معظم الدائرة

source: Your height is used to calibrate YOLO body measurements for accuracy.
ar: يُستخدم طولك لمعايرة قياسات جسم YOLO للدقة.

source: Your images are never stored, only measurements
ar: صورك لا تُخزن أبداً، فقط القياسات

source: Both images captured successfully!
ar: تم التقاط الصورتين بنجاح!

source: Click Process Scan to analyse your measurements & skin tone
ar: اضغط معالجة المسح لتحليل قياساتك ولون بشرتك

source: Experience the future of clothing shopping today
ar: جرّب مستقبل تسوق الملابس اليوم

source: Here are your personalised results
ar: إليك نتائجك المخصصة

source: in stock right now
ar: متوفر في المخزون الآن

source: left
ar: متبقي

source: Network error. Please check your connection and try again.
ar: خطأ في الشبكة. يرجى التحقق من الاتصال والمحاولة مرة أخرى.

source: or click to browse
ar: أو اضغط للتصفح

source: Three simple steps to find your perfect fit
ar: ثلاث خطوات بسيطة لمعرفة مقاسك المثالي

source: undertone
ar: درجة لونية

source: You can start over if needed
ar: يمكنك البدء من جديد إذا لزم الأمر
